In [1]:
import pandas as pd

### df manipulation

In [35]:
df['Name']

0     tom
1    nick
2    juli
Name: Name, dtype: object

In [36]:
type(df['Name'])

pandas.core.series.Series

In [37]:
df[['Name']]

   Name
0   tom
1  nick
2  juli

In [38]:
type(df[['Name']])

pandas.core.frame.DataFrame

In [39]:
df['Age'].max()

20

In [40]:
df[df['Age']>10]

   Name  Age
1  nick   15
2  juli   20

In [42]:
df[df['Age']>10][['Name']]

   Name
1  nick
2  juli

In [46]:
df.loc[df.Name.str.contains('nic')]

   Name  Age
1  nick   15

In [52]:
df1 = df[~df['Name'].str.contains('nick')]
df1

   Name  Age
0   tom   10
2  juli   20

In [54]:
df1 = df[~df['Name'].isin(['nick', 'tom'])]
df1

   Name  Age
2  juli   20

In [55]:
df[~df['Name'].str.contains("#@'Â£$%abc?", regex=False)]

   Name  Age
0   tom   10
1  nick   15
2  juli   20

In [57]:
df['tmp'] = df['Name'].str.replace('o','oo')
df

   Name  Age   tmp
0   tom   10  toom
1  nick   15  nick
2  juli   20  juli

In [58]:
df1 = df.loc[df.Name.str.len() > len('hello')].reset_index(drop=True)
df1

Empty DataFrame
Columns: [Name, Age, tmp]
Index: []

In [4]:
df1 = df[df['Name'].notna()]
df1

   Name  Age
0   tom   10
1  nick   15
2  juli   20

In [7]:
import numpy as np

In [ ]:
df['a'] = df['a'].astype(int)

In [10]:
df['a'] = pd.to_numeric(df['a'])

### lambda

In [14]:
df = df.apply(lambda x:np.square(x) if x.name == 'd' else x, axis=1)

In [ ]:
df.apply(lambda x: func(x['col1'], x['col2']), axis=1)

In [ ]:
df['c'] = df.apply(lambda x:max(len(x['a']), len(x['b'])), axis=1)

In [ ]:
df['a'] = df.apply(lambda x: x['b'][x['b'].find('=')+1:len(x['b'])-1], axis=1)

In [ ]:
df['a'] = df.apply(lambda x:time.strftime('%Y-%m-%d %H:%M:%S', time.localtime(x['a']/1000)), axis=1)

### update column based on condition

In [ ]:
df['user2'] = np.where((df['user']=='Unknown'), df['path'].apply(lambda x: x.split('/')[4]), df['user'])

In [ ]:
df.loc[df['a'].str.contains('/'), 'new_col'] = df['a'] #create new column new_col from col c

In [ ]:
df.loc[df['a']=='Unknown', 'new_col']=df['a']=='Unknown']['b'].apply(lambda x: x.split('/')[4])

In [ ]:
df['a'] = df['b'].map(str) + df['c'].map(str)

In [ ]:
df['c'] = np.where(
    df['a']==df['b'],0, np.where(
        df['a']>df['b'],1,-1))

In [ ]:
def f(row):
    if row['a'] == row['b']:
        val = 0
    elif row['a'] > row['b']:
        val = 1
    else:
        val = -1
    return val

df['c'] = df.apply(f, axis=1)

In [ ]:
df[(df['a'])>=1) & (df['b']<=1)]

In [ ]:
df['a'] = np.where(df[b].apply(lambda x:x in list1), True, False)

In [ ]:
df.sort_values(['date'], ascending=[False])

In [ ]:
df.groupby(['a','b','c']).\
agg({'latest_date':'max', 'size_in_mb':'sum', 'path':'count'}).\
rename(columns={'path':'file_count'}).\
reset_index().sort_values('size_in_mb', ascending=0).\
reset.index().drop(columns={'index'})

In [ ]:
df3 = pd.merge(df1, df2, how="left", on=["col1", "col2"]

In [43]:
pd.set_option('max_colwidth', 1000)

In [5]:
pd.options.mode.chained_assignment = None # default='warn'

In [ ]:
df = pd.read_csv('student.csv')

In [ ]:
df = ps.read_csv('path/abc.csv', header=None, delimiter=',', index_col=False, 
    warn_bad_lines=True, error_bad_lines=False, skiprows=[i for i in range(100, 200)])

In [ ]:
df.to_csv('student.csv', index=False)

In [ ]:
start_index = lst_path[:lst_path.find(key_word)-1].rfind('/')

In [ ]:
lst_string = [x.decode('utf-8', 'ignore') for x in list_of_byte_string]